package com.example.abdulaziz.project;

import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.text.Html;
import android.widget.TextView;

public class aboutCollege_page extends AppCompatActivity
{

   TextView textView;
    @Override
    protected void onCreate(Bundle savedInstanceState)
    {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_about_college_page);

        textView=findViewById(R.id.textView);

        textView.setText(Html.fromHtml("<p>  صدر قرار مجلس الوزراء رقم 158 وتاريخ 12 / 6/ 1429 هـ بالموافقة على الخطة العامة للتدريب بالمؤسسة\n" +
                " العامة للتدريب التقني والمهني التي تضمنت:: <br>\n" +
                "<h1>\n" +
                "الرؤية\n" +
                "</h1>\n" +
                "الإسهام الفاعل في التنمية الاقتصادية والاجتماعية والبيئية بتوفير التدريب التقني والمهني لأبناء وبنات الوطن بالجودة والكفاية التي يتطلبها سوق العمل، وتحقيق ريادة عالمية تكفل الاستقلالية والاكتفاء الذاتي. <br>\n" +
                "\n" +
                "<h1>\n" +
                "الرسالة\n" +
                "</h1>\n" +
                " <h5>\n" +
                "تسعى المؤسسة العامة للتدريب التقني والمهني إلى: <br>\n" +
                " </h5>\n" +
                "<br>\n" +
                "\n" +
                "1 تطوير وتقديم وترخيص البرامج التدريبية التقنية والمهنية؛ حسب الطلب الكمي والنوعي لسوق العمل للذكور والإناث، وسنِّ التنظيمات المختصة بجودتها وكفايتها والإشراف عليها.<br>\n" +
                "\n" +
                "2.      توعية المجتمع بأهمية التدريب التقني والمهني وإتاحة فرصة التدرب للقادرين من الذكور والإناث لجميع الفئات العمرية. <br>\n" +
                "\n" +
                "3.      القيام بالأبحاث والمشاريع الضرورية لمتابعة التطورات التقنية والتوجهات العالمية في مجال التدريب التقني والمهني. <br>\n" +
                "\n" +
                "4.      المشاركة في البرامج الوطنية التي تتبنى نقل التقنية وتوطينها، وتوفير دعمها ودعم القطاع الخاص، وتوجيهه للاستثمار في مجال التدريب التقني والمهني.<br>\n" +
                "\n" +
                "\n" +
                "<h1>\n" +
                " الأهداف الاستراتيجية: <br>\n" +
                "<br>\n" +
                "</h1>\n" +
                "1.      استيعاب أكبر عدد من الراغبين في التدريب التقني والمهني؛ للإسهام في تحقيق التنمية المستدامة. : <br>\n" +
                "2.      تأهيل وتطوير الكوادر البشرية الوطنية في المجالات التقنية والمهنية؛ وفقًا لطلب سوق العمل الكمي والنوعي. <br>\n" +
                "3.      تقديم البرامج التدريبية بالجودة والكفاية التي تؤهل المتدرب للحصول على عمل مناسب في سوق العمل الحر. <br>\n" +
                "4.      القدرة على التكيف والتعامل بنجاح مع التحديات والتغيرات؛ استناداً إلى الأبحاث والدراسات التطبيقية. : <br>\n" +
                "5.      بناء شراكات استراتيجية مع قطاع الأعمال؛ لتنفيذ برامج تقنية مهنية. <br>\n" +
                "6.      نشر الوعي بأهمية العمل في المجالات التقنية والمهنية في أوساط المجتمع، وتوفير البيئة المناسبة للتدرب مدى الحياة.  <br>\n" +
                "7.      إيجاد بيئة آمنة ومحفِّزة للعمل والتدريب في المؤسسة العامة للتدريب التقني والمهني.  <br>\n" +
                "8.      تشجيع الاستثمار في التدريب التقني والمهني والتدريب الأهلي. <br>\n" +
                "9.      توثيق العلاقة والتكامل مع الجهات التعليمية والتدريبية الوطنية.  <br>\n" +
                "10.  التوسع في المجالات التدريبية المتقدمة الداعمة للخطط الوطنية والمشاركة في برامج نقل التقنية وتطويرها. <br>\n" +
                "<br>\n" +
                " <h5>\n" +
                "وقد وضعت المؤسسة العامة للتدريب التقني والمهني عدداً من الأهداف التي يجب تحقيقها، وهي كالتالي:<br> <br>\n" +
                "</h5>\n" +
                "1.      اعداد الفرد اللازم للقيام بالنشاطات المطلوبة في المجالات الصناعية والتجارية والزراعية والخدمات التي تساهم في رفع الاقتصاد الوطني، سواء أكان ذلك بالعمل في المؤسسات العامة أو الوزارات، أو الشركات الأهلية أو في العمل الحر. <br>\n" +
                "2.      تزويد الفرد بالثقافة الإسلامية والثقافة العامة اللتين تساهمان في تكوين الخلق الرفيع، والإيمان القوي والمقدرة على التفاهم والتفكير، والتكيف مع البيئات المختلفة. <br>\n" +
                "3.      تأمين قاعدة علمية عريضة للعمالة الفنية ليصبح من السهل أن يتجاوب الفرد مع التطور السريع في التكنولوجيا والعلوم التقنية. <br>\n" +
                "4.      فتح المجال أمام كل راغب لتعلم مهنة أو مواصلة تدريبه لأقصى ما تسمح به إمكاناته العقلية والجسمية، وهذا ما يسمى بسلم التدريب المفتوح. <br>\n" +
                "5.      تطوير مهارات الفنيين وتحديث معلوماتهم المهنية باستمرار.  <br>\n" +
                "6.      التأكيد على كرامة العمل اليدوي والمهني ودورهما في ازدهار المجتمع. <br>\n" +
                "7.      المساهمة في إيقاف الهجرة الداخلية إلى المدن الكبرى، وذلك بنشر مراكز التدريب المهني في جميع مناطق المملكة. <br>\n" +
                "<br>\n" +
                "<h1>\n" +
                "استراتيجية تنفيذ الأهداف: <br>\n" +
                "<br>\n" +
                "</h1>\n" +
                "1.      إعداد وتدريب المواطن السعودي للقيام بالأعمال المهنية والحرفية والفنية في القطاعات المختلفة (الصناعية والزراعية والتجارية والخدمات العامة) سواء في العمل الحر لدى الشركات أو العمل في الحكومة والقطاع العام، هذا إلى جانب التدريب داخل الكليات والمعاهد والمراكز والسعي لمواصلة تطوير ورفع مستوى الفنيين والمهنيين على رأس العمل لإكسابهم المعارف المتطورة في مجال العلوم والتكنولوجيا سواء داخل المملكة أو خارجها.: <br>\n" +
                "2.      السعي لتهيئة الأميين واليافعين الذين لم يواصلوا تعليمهم الأكاديمي، بتوجيههم وتدريبهم في برامج مخصصة صباحية ومسائية، وفقاً للسن والقدرات والميول، لمواصلة تعليمهم او ممارسة العمل الفني. <br>\n" +
                "3.      اعداد الكوادر السعودية الفنية من المدرسين والمدربين. <br>\n" +
                "4.      توجيه الاستثمار لتطوير هيكل المهارة لتوسيع قاعدة العمل الفني بالمملكة.<br>\n" +
                "5.      إيجاد هيكل تعليمي ذي سلم موحد لتدعيم العمالة الفنية بالتنسيق مع أجهزة التأهيل البشري واللجنة الوزارية للقوى العاملة.<br>\n" +
                "6.      دعم عمليات التوجيه المهني بإثارة الوعي الفني والمهني بواسطة الأجهزة المعنية وذلك بمردود أفضل لخدمات المؤسسة من الناحيتين الفنية والتدريبية لتحقيق الأهداف المرجوة.<br>\n" +
                "7.      الاهتمام بالبحوث والدراسات لمعالجة مشكلات العمالة الفنية في ضوء احتياجات سوق العمل.<br>\n  </p>"));
    }
}
